Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t
Serialization structures for Tekla.Structures.ModelInternal.BuildingSpaces.Space

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.id
Field for Tekla.Structures.ModelInternal.BuildingSpaces.Space id.

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.aGuid
The guid of the building hierarchy space.

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.aName
Field for Tekla.Structures.ModelInternal.BuildingSpaces.Space.Name.

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.Number
Field for Tekla.Structures.ModelInternal.BuildingSpaces.Space.Number.

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.aBrepShapeName
Field for Tekla.Structures.ModelInternal.BuildingSpaces.Space.Zone.

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.aZone
Field for Tekla.Structures.ModelInternal.BuildingSpaces.Space.Zone.

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.aDescription
Field for Tekla.Structures.ModelInternal.BuildingSpaces.Space.Description.

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.height
Field for Tekla.Structures.ModelInternal.BuildingSpaces.Space.Height.

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.bottom_offset
Field for Tekla.Structures.ModelInternal.BuildingSpaces.Space.BottomOffset.

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.volume
Field for Tekla.Structures.ModelInternal.BuildingSpaces.Space.Volume.

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.aParentGuid
Field for parents guid.

Tekla.Structures.ModelInternal.dotBuildingSpacesSpaceOperation_t.OperationType
Field for the operation type.